// Copyright 2008 Cyrus Najmabadi
// 
// Licensed under the Apache License, Version 2.0 (the "License");
// you may not use this file except in compliance with the License.
// You may obtain a copy of the License at
// 
//     http://www.apache.org/licenses/LICENSE-2.0
// 
// Unless required by applicable law or agreed to in writing, software
// distributed under the License is distributed on an "AS IS" BASIS,
// WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
// See the License for the specific language governing permissions and
// limitations under the License.

/* $19.99.  Widescreen DVD - 2 discs. */
"$%@. %@ - %@ discs." = "$%@. %@ - %@ levyä.";

/* $19.99.  Widescreen DVD - 1 disc. */
"$%@. %@ - 1 disc." = "$%@. %@ - 1 levy.";

/* i.e.: 2 hours 34 minutes */
"%@ %@" = "%1$@ %2$@";

/* Netflix queue title and title count.  i.e: 'Instant Queue (45)' */
"%@ (%@)" = "%1$@ (%2$@)";

/* %@ will be replaced with a movie showtime.  i.e. '3:15pm' */
"%@ (No Online Ticketing)" = "%@ (Ei lippujen verkkokauppaa)";

/* Rated R. 2 hours 34 minutes */
"%@. %@" = "%1$@. %2$@";

/* 5 kilometers or 5 miles */
"%d %@" = "%1$d %2$@";

/* i.e.: 2 hours */
"%d hours" = "%d hours";

/* i.e.: 30 minutes */
"%d minutes" = "%d minuuttia";

/* No comment provided by engineer. */
"%d months ago" = "%d kuukautta sitten";

/* i.e.: 5 of 15.  Used when scrolling through a list of posters */
"%d of %d" = "%d / %d";

/* i.e.: 10 theaters outside search area */
"%d theaters outside search area" = "%d teatteria hakualueen ulkopuolella";

/* No comment provided by engineer. */
"%d weeks ago" = "%d viikkoa sitten";

/* No comment provided by engineer. */
"%d years ago" = "%d vuotta sitten";

/* No comment provided by engineer. */
"1 hour" = "1 tunti";

/* No comment provided by engineer. */
"1 kilometer" = "1 kilometri";

/* No comment provided by engineer. */
"1 mile" = "1 maili";

/* No comment provided by engineer. */
"1 minute" = "1 minuutti";

/* No comment provided by engineer. */
"1 month ago" = "1 kuukausi sitten";

/* No comment provided by engineer. */
"1 theater outside search area" = "1 teatteri hakualueen ulkopuolella";

/* No comment provided by engineer. */
"1 week ago" = "1 viikko sitten";

/* No comment provided by engineer. */
"1 year ago" = "1 vuosi sitten";

/* Title for the 'About' page (where we list who was involved in making the program and who supplied the data) */
"About" = "Tietoja";

/* This string has to be small enough to be visible with a picker switch next to it.  It means 'automatically update the user's location with GPS information' */
"Auto-Update Location" = "Päivitä sijainti automaattisesti";

/* No comment provided by engineer. */
"Blu-ray" = "Blu-ray";

/* This string should try to be short.  So abbreviations are acceptable. It's a verb that means 'to make a phonecall' */
"Call" = "Soita";

/* No comment provided by engineer. */
"Cast:" = "Näyttelijät:";

/* Title for a button. Needs to be very short. 2-3 words *max*. It means 'i want to change the date so i can see information from a different date' */
"Change date" = "Vaihda päivä";

/* No comment provided by engineer. */
"City/State or Postal Code" = "Kaupunki/kunta tai postinumero";

/* No comment provided by engineer. */
"Could not find location." = "Sijaintia ei löytynyt.";

/* No comment provided by engineer. */
"DVD" = "DVD";

/* No comment provided by engineer. */
"DVD/Blu-ray" = "DVD/Blu-ray";

/* No comment provided by engineer. */
"DVD/Blu-ray details:" = "DVD/Blu-ray -tiedot:";

/* No comment provided by engineer. */
"Data for future dates may be incomplete. Reset the search date to the current date to see full listings." = "Tulevien päivien tiedot voivat olla puutteellisia. Aseta hakupäivä nykyiseen päivään nähdäksesi täydelliset tiedot.";

/* No comment provided by engineer. */
"Director:" = "Ohjaaja:";

/* No comment provided by engineer. */
"Directors:" = "Ohjaajat:";

/* Must be very short. 1 word max. This is on a button that allows users to sort theaters by distance */
"Distance" = "Etäisyys";

/* No comment provided by engineer. */
"Downloading data" = "Haetaan tietoja";

/* No comment provided by engineer. */
"Downloading image" = "Haetaan julistetta";

/* Title for a button. Needs to be very short. 2-3 words *max*. It means 'email the theater listings to a friend' */
"E-mail listings" = "Sähköpostiin";

/* No comment provided by engineer. */
"Favorites" = "Suosikit";

/* Label for the format of a movie.  i.e.:  Format: Widescreen */
"Format:" = "Formaatti:";

/* No comment provided by engineer. */
"Genre:" = "Lajityyppi:";

/* No comment provided by engineer. */
"Geolocation services provided by:" = "Paikannustietopalvelut:";

/* No comment provided by engineer. */
"Graphics by Jeffrey Nee" = "Grafiikka: Jeffrey Nee";

/* No comment provided by engineer. */
"Last Friday" = "Viime perjantaina";

/* No comment provided by engineer. */
"Last Monday" = "Viime maanantaina";

/* No comment provided by engineer. */
"Last Saturday" = "Viime lauantaina";

/* No comment provided by engineer. */
"Last Sunday" = "Viime sunnuntaina";

/* No comment provided by engineer. */
"Last Thursday" = "Viime torstaina";

/* No comment provided by engineer. */
"Last Tuesday" = "Viime tiistaina";

/* No comment provided by engineer. */
"Last Wednesday" = "Viime keskiviikkona";

/* plural. refers to a distance like 'Less than 2 miles away' */
"Less than %d %@ away" = "Alle %1$d %2$@";

/* singular. refers to a distance like 'Less than 1 mile away' */
"Less than 1 %@ away" = "Alle 1 %@";

/* No comment provided by engineer. */
"License" = "Lisenssi";

/* No comment provided by engineer. */
"Loading image" = "Ladataan julistetta";

/* No comment provided by engineer. */
"Local results unavailable" = "Paikallisia tietoja ei saatavilla";

/* No comment provided by engineer. */
"Localized by:" = "Lokalisoinnit:";

/* No comment provided by engineer. */
"Location" = "Sijainti";

/* This string should try to be short.  So abbreviations are acceptable. It's a verb that means 'open a map to the currently listed address' */
"Map" = "Kartta";

/* No comment provided by engineer. */
"Movie details provided by:" = "Elokuvatiedot:";

/* No comment provided by engineer. */
"Movie reviews provided by:" = "Elokuva-arvostelut:";

/* No comment provided by engineer. */
"Movies" = "Elokuvat";

/* Must be very short. 1 word max. This is on a button that allows users to sort theaters by their name */
"Name" = "Nimi";

/* No comment provided by engineer. */
"Network unavailable" = "Ei verkkoa";

/* No comment provided by engineer. */
"No information found" = "Tietoja ei löytynyt";

/* Message shown when the user searches for something and we find no results */
"No results found for '%@'" = "Ei hakutuloksia '%@'";

/* No comment provided by engineer. */
"No synopsis available." = "Ei tiivistelmää saatavilla.";

/* This is what a user picks when they don't want any reviews. */
"None" = "Ei mitään";

/* No comment provided by engineer. */
"Not yet rated" = "Ei vielä ikärajaa";

/* No comment provided by engineer. */
"OK" = "OK";

/* %@ will be replaced with a movie showtime.  i.e.: Order tickets for 3:15pm */
"Order tickets for %@" = "Tilaa liput %@";

/* Title for a button. Needs to be very short. 2-3 words *max*. User taps it when they want to watch the trailer for a movie */
"Play trailer" = "Toista näyte";

/* No comment provided by engineer. */
"Please enter your location" = "Syötä sijaintisi";

/* Takes the user to the website for this application */
"Project Website" = "Projektin websivu";

/* %@ will be replaced with a movie rating.  i.e.: Rated PG-13 */
"Rated %@" = "Ikäraja %@";

/* No comment provided by engineer. */
"Rated:" = "Ikäraja:";

/* Title for a button. Needs to be very short. 2-3 words *max*. User taps it when they want to read the critics' reviews for a movie */
"Read reviews" = "Lue arvosteluja";

/* No comment provided by engineer. */
"Really close by" = "Todella lähellä";

/* No comment provided by engineer. */
"Really far away" = "Todella kaukana";

/* Must be very short. 1 word max. This is on a button that allows the user to sort movies based on how recently they were released. */
"Release" = "Ensi-ilta";

/* No comment provided by engineer. */
"Release date:" = "Ensi-iltapvm:";

/* This is a shorter form of 'Release date:'. Used when there's less onscreen space. */
"Release: %@" = "Ensi-ilta: %@";

/* No comment provided by engineer. */
"Reviews" = "Arvostelut";

/* No comment provided by engineer. */
"Running time:" = "Kesto:";

/* Must be very short. 1 word max. This is on a button that allows users to sort movies by how well they were rated. */
"Score" = "Arvosana";

/* This is noun, not a verb. It is the date we are getting movie listings for. */
"Search Date" = "Hakupäivä";

/* No comment provided by engineer. */
"Search Distance" = "Hakuetäisyys";

/* Title for a button that a user can click on to send a feedback email to the developers */
"Send Feedback" = "Lähetä palautetta";

/* No comment provided by engineer. */
"Settings" = "Asetukset";

/* We hide theaters if they are too far away.  But we provide this button to let the user 'unhide' in case it's the only theater showing a movie they care about. */
"Show %d hidden theaters" = "Näytä %d piilotettua teatteria";

/* We hide theaters if they are too far away.  But we provide this button to let the user 'unhide' in case it's the only theater showing a movie they care about. */
"Show 1 hidden theater" = "Näytä 1 piilotettu teatteri";

/* When the user wants to see 'Both' DVD and Bluray items */
"Show Both" = "Molemmat";

/* %@ will be replaced with a date.  i.e.: 04/30/2008 */
"Show times retrieved on %@." = "Näytösajat haettu %@.";

/* No comment provided by engineer. */
"Studio:" = "Studio:";

/* %@ will be replaced with a date.  i.e.: 04/30/2008 */
"Theater last reported show times on\n%@." = "Teatterin viimeksi ilmoittamat näytösajat \n%@.";

/* No comment provided by engineer. */
"Theater providers often limit the maximum search distance they will provide data for. As a result, some theaters may not show up for you even if your search distance is set high." = "Elokuvateatteriyritykset rajoittavat usein kuinka kaukaa etäisyyden perusteella hakiessa voidaan saada tuloksia. Sen vuoksi jotkut teatterit eivät näy hakutuloksissa, vaikka hakuetäisyys olisi asetettu kovinkin isoksi.";

/* No comment provided by engineer. */
"Theaters" = "Teatterit";

/* No comment provided by engineer. */
"This theater has not yet reported its show times. When they become available, %@ will retrieve them automatically." = "Tämä teatteri ei ole ilmoittanut näytösaikojaan. Niiden tultua saataville, %@ hakee ne automaattisesti.";

/* No comment provided by engineer. */
"Ticket sales provided by:" = "Lipunmyynti:";

/* Must be very short. 1 word max. This is on a button that allows the user to sort movies based on their title. */
"Title" = "Elokuva";

/* No comment provided by engineer. */
"Today" = "Tänään";

/* No comment provided by engineer. */
"Unknown Distance" = "Etäisyys ei tiedossa";

/* The release date for a movie is unknown. */
"Unknown Release Date" = "Ensi-ilta ei tiedossa";

/* No comment provided by engineer. */
"Unrated" = "Ei ikärajaa";

/* No comment provided by engineer. */
"Upcoming" = "Tulevat";

/* This string has to be small enough to be visible with a picker switch next to it.  It means 'don't shrink the fonts when you have lots of stuff to display' */
"Use Small Fonts" = "Pieni fontti";

/* No comment provided by engineer. */
"Website" = "Websivu";

/* No comment provided by engineer. */
"Written by Cyrus Najmabadi" = "Tekijä: Cyrus Najmabadi";

/* No comment provided by engineer. */
"Yesterday" = "Eilen";

/* The first %@ will be replaced with the device the user is on (i.e.: iPhone), the second %@ is replaced with the program name (i.e.: Now playing) */
"Your %@'s country is set to: %@\n\nFull support for %@ is coming soon to your country, and several features are already available for you to use today! When more features become ready, you will automatically be notified of updates." = "%@si maa-asetus on: %@\n\n%@ tulee toimimaan myös suomalaisten teattereiden kanssa, ja osaa ohjelman ominaisuuksista voit käyttää jo nyt! Kun uudet toiminnallisuudet valmistuvat, päivityksistä ilmoitetaan automaattisesti.";

/* No comment provided by engineer. */
"kilometer" = "kilometri";

/* No comment provided by engineer. */
"kilometers" = "kilometriä";

/* No comment provided by engineer. */
"mile" = "maili";

/* No comment provided by engineer. */
"miles" = "mailia";